Repository: Rusutikaa/docs
Catalog: OmegaT_tmx/OmegaT_tmx_Framework_SwiftUI/project_save.tmx
Source language: en_us
Languages: ja

source: Creating an Alert
ja: 警報を作成する

source: Creating an Angular Gradient
ja: 角度勾配（グラデーション）を作成する

source: Creating an Axis
ja: 軸を作成する

source: Creating an Axis Set
ja: 軸集合を作成する

source: Creating an Edit Button
ja: 編集ボタンを作成する

source: Creating an Ellipse
ja: 楕円を作成する

source: Creating an Empty Modifier
ja: 空の修飾子を作成する

source: Creating an Empty View
ja: 空のビューを作成する

source: Creating an Environment Instance
ja: 環境インスタンスを作成する

source: Creating an Environment Object
ja: 環境オブジェクトを作成する

source: Creating an Environment Values Instance
ja: 環境値インスタンスを作成する

source: Creating an Equatable View
ja: 同一視可能ビューを作成する

source: Creating an Event Modifier
ja: イベント修飾子を作成する

source: Creating an Exclusive Gesture
ja: 排他的ジェスチャを作成する

source: Creating an Image
ja: 画像を作成する

source: Creating an In-progress Gesture
ja: 進行中ジェスチャを作成する

source: Creating an Observed Object
ja: 監視されるオブジェクトを作成する

source: Creating an Offset Shape
ja: オフセット形状を作成する

source: Creating and Combining Views
ja: ビューを作成するそして構成する

source: Creating and Initializing Node Objects
ja: ノードオブジェクトの作成と初期化

source: Creating and Initializing an NSTask Object
ja: NSTaskオブジェクトの作成と初期化

source: Creating and Updating the Interface Object
ja: インターフェイスオブジェクトを作成および更新する

source: Creating and Updating the View
ja: ビューの作成と更新

source: Creating and Updating the View Controller
ja: ビューコントローラを作成および更新する

source: Creating the Button Style
ja: ボタンスタイルを作成する

source: Creating the Text Field Style
ja: テキスト欄スタイルを作成する

source: Currently, PasteButton will not automatically invalidate on pasteboard changes, and so should be mainly used in transient contexts like in ContextMenu.
ja: 現在は、PasteButtonは、自動的にペーストボード上で変更を無効にしないでしょう、そしてそれで主としてContextMenuでのような一時的な前後関係において使われるべきです。

source: Currently, that view will be placed in the center of the row.
ja: 現在、そのビューは横列の中心に置かれます。

source: Custom Gestures
ja: カスタムジェスチャ

source: Customize animations and transitions.
ja: アニメーションと遷移をカスタマイズします。

source: Customizing Accessibility Interactions of a View
ja: ビューのアクセシビリティ相互作用をカスタマイズする

source: Customizing Accessibility Labels of a View
ja: ビューのアクセシビリティラベルをカスタマイズする

source: Customizing Accessibility Navigation of a View
ja: ビューのアクセシビリティナビゲーションをカスタマイズする

source: Customizing View Accessibility
ja: ビューアクセシビリティをカスタマイズする

source: Customizing the Help Text of a View
ja: ビューのヘルプテキストをカスタマイズする

source: DTD Node Kind Constants
ja: DTDノード種類定数

source: Data Formatting
ja: データ書式設定

source: Data and Events
ja: データとイベント

source: Data-Dependent Views
ja: データ依存の値

source: Date Picker Styles
ja: 日付ピッカースタイル

source: Dates and Times
ja: 日付と時刻

source: Declaration
ja: 宣言

source: Declare a property as @GestureState, pass as a binding to it as a parameter to a gesture’s updating(_:body:) callback, and receive updates to it.
ja: あるプロパティを@GestureStateとして宣言してください、それへのバインディングとしてジェスチャのもつupdating(_:body:)コールバックへのパラメータとして渡してください、そしてそれに対する更新を受け取ってください。

source: Declare the user interface and behavior for your app on every platform.
ja: ユーザインターフェイスと挙動をあなたのアプリに対してあらゆるプラットホーム上で宣言します。

source: Declare your app by creating a structure that conforms to the App protocol and add one or more scenes to it.
ja: あなたのアプリをある構造体を作成することによって宣言してください、それはAppプロトコルに準拠するそして１つ以上のシーンをそれに加えるものです。

source: Declares a context for the preview.
ja: プレビューに対する前後関係を宣言します。

source: Declares the content and behavior of this view.
ja: このビューの内容と挙動を宣言します。

source: Default Implementations
ja: 省略時実装

source: Default implementation provided.
ja: 提供される省略時の実装。

source: Default implementations provided.
ja: 提供される省略時の実装。

source: Default is .device.
ja: 省略時は.deviceです。

source: Default is true.
ja: 省略時はtrueです。

source: Default is false.
ja: 省略時はfalseです。

source: Defaults to true.
ja: 省略時はtrueです。

source: Defaults to nil.
ja: 省略時にはnilになります。

source: Define a structure that conforms to the Widget protocol, and declare a view hierarchy for the widget.
ja: ある構造体を定義してください、それはWidgetプロトコルに準拠するものです、そしてあるビュー階層をそのウィジェットに対して宣言してください。

source: Define additional views for the view to present under specified conditions.
ja: 追加のビューをビューに対して定義して、指定された条件の下で提示します。

source: Define document types.
ja: 書類型を定義します。

source: Define interactions from taps, clicks, and swipes to fine-grained gestures.
ja: タップ、クリック、そしてスワイプからきめ細かいジェスチャまで相互作用を定義します。

source: Define the entry point and top-level organization of your app.
ja: あなたのアプリのエントリポイントとトップレベル組織化を定義してください。

source: Define your app structure using the App protocol, and populate it with scenes that contain the views that make up your app’s user interface.
ja: あなたのアプリの構造をAppプロトコルを使って定義してください、そしてそれをさまざまなシーンで満たしてください、それらはさまざまなビューを含み、それらはあなたのアプリのユーザインターフェイスを作り上げます。

source: Defines NO as 0.
ja: NOは0として定義します。

source: Defines YES as 1.
ja: YESは1として定義します。

source: Defines a group of views with synchronized geometry using an identifier and namespace that you provide.
ja: 同期された幾何学でのビューそれらからなるあるグループを定義します、あなたが提供する識別子と名前空間を使っています。

source: Defines the content shape for hit testing.
ja: ヒットテストするための内容形状を定義します。

source: Defines the destination for a drag and drop operation with the same size and position as the view by handling dropped content with the specified closure.
ja: ドラッグアンドドロップ操作に対する行き先を定義します、ビューと同じ大きさと位置で、ドロップされた内容をこの指定されたクロージャで取り扱うことによって。

source: Defines the destination of a drag and drop operation with the same size and position as the view by handling dropped content and the drop location with the specified closure.
ja: ドラッグアンドドロップ操作の行き先をビューと同じ大きさと位置で定義します、ドロップされた内容とドロップ位置をこの指定されたクロージャで取り扱うことによって。

source: Defines the destination of a drag and drop operation with the same size and position as the view using behavior controlled by the given delegate.
ja: ドラッグアンドドロップ操作の行き先を、ビューと同じ大きさと位置で定義します、この与えられた委任先によって制御された挙動を使って。

source: Defines the shape of a rounded rectangle’s corners.
ja: 丸められた矩形のもつ角の形状を定義します。

source: Defining a Shape’s Path
ja: 形状のもつパスを定義する

source: Delete
ja: 削除

source: Depending on the callbacks you add to a gesture modifier, SwiftUI reports back to your code whenever the state of the gesture changes.
ja: あなたがジェスチャ修飾子へと加えるコールバックに依存して、SwiftUIはジェスチャの状態が変化する時はいつでもあなたのコードに報告します。

source: Depending on the surrounding view hierarchy, SwiftUI may not honor an edgesIgnoringSafeArea(_:) request.
ja: 取り巻くビュー階層に依存して、SwiftUIはedgesIgnoringSafeArea(_:)要請を履行しないかもしれません。

source: Deprecated
ja: 非推奨

source: Deprecated Symbols
ja: 非推奨シンボル

source: Describes this shape as a path within a rectangular frame of reference.
ja: このシェイプをパスとしてある矩形の基準系の内部に記述します。

source: Describing a Color
ja: 色を記述する

source: Detaches the receiver from its parent node.
ja: レシーバをそれの親ノードから分離します。

source: Diacritic and Combining Mark Removal
ja: 区別的発音符および結合記号の除去

source: Directions
ja: 方向

source: Disable all gestures in the subview hierarchy, including the added gesture.
ja: 全てのジェスチャをサブビュー階層において無効にします、加えられたジェスチャを含めて。

source: Disabling autocorrection allows the user to enter arbitrary text without the autocorrection system offering suggestions or attempting to override their input.
ja: 自動修正を無効にすることは、ユーザに自由気ままなテキストを打ち込ませます、自動修正システムが提案を提示したり彼らの入力を覆そうとすることなしに。

source: Discussion
ja: 議論

source: Dismissing Presentation
ja: 提示を片付ける

source: Display a large title within an expanded navigation bar.
ja: 大きなタイトルをある拡張されたナビゲーションバー内に表示します。

source: Display the content of your hosting controller as you would any other WKInterfaceController object.
ja: あなたのホスティングコントローラの内容を、あなたが何か他のWKInterfaceControllerオブジェクトでするように表示してください。

source: Display the title within the standard bounds of the navigation bar.
ja: タイトルをナビゲーションバーの標準境界内に表示します。

source: Displays day, month, and year based on the locale
ja: 日にち、月、そして年をロケールに基づいて表示します。

source: Displays hour and minute components based on the locale
ja: 時間と分構成要素をロケールに基づいて表示します。

source: Do not call this initializer directly.
ja: このイニシャライザを直接に呼ばないでください。

source: Do not include a filename extension or leading path information as part of the name.
ja: ファイル名拡張子または先頭のパス情報を名前の一部として含めないでください。

source: Do not persist the hash value across program runs.
ja: プログラム実行を越えてハッシュ値に固執しないでください。

source: Do not save hash values to use during a future execution.
ja: ハッシュ値を将来の遂行の間に使うために保存しないでください。

source: Document Content Types
ja: 書類のコンテンツタイプ

source: Don't create this structure yourself.
ja: この構造体をあなた自身で作成しないでください。

source: Don’t include text in the label that repeats information that users already have.
ja: ユーザが既に持つ情報を繰り返すテキストをラベルの中に含めないでください。

source: Drawing Paths and Shapes
ja: パスと形状を描画する

source: Drawing and Animation
ja: 描画とアニメーション

source: DropDelegate Implementations
ja: DropDelegate実装

source: During layout, the hosting view reports the content size preferences of your SwiftUI views back to the AppKit layout system so that it can size the view appropriately.
ja: レイアウトの間、ホスティングビューはあなたのSwiftUIビューのコンテンツサイズ環境設定をAppKitレイアウトシステムに遡って報告します、そうすることでそれはビューを適切に大きさ指定できます。

source: During the next update cycle, the hosting controller fetches an updated set of views from its body property.
ja: 次の更新周期の間に、ホスティングコントローラは更新されたビューの一揃いをそれのbodyプロパティから取って来ます

source: Dynamic View Properties
ja: 動的ビュープロパティ

source: DynamicProperty Implementations
ja: DynamicProperty実装

source: Each TouchBarItemPresence must be initialized with a string that is a globally unique identifier for this item.
ja: 各TouchBarItemPresenceは、ある文字列で初期化されなければなりません、それはこの項目に対するグローバルに特有な識別子です。

source: Each gesture you add applies to a specific view in the view hierarchy.
ja: あなたが加える各ジェスチャは、ビュー階層の中のある特定のビューに適用されます。

source: Each instance needs a unique identifier.
ja: 各インスタンスは、固有識別子を必要とします。

source: Each platform provides a default style that reflects the platform style, but providing a new style will redefine all Slider instances within that environment.
ja: 各プラットホームは、プラットホームスタイルを反映するある省略時のスタイルを提供します、しかし新しいスタイルを提供することは、全てのSliderインスタンスをその環境内で再定義するでしょう。

source: Each platform provides a default style that reflects the platform style, but providing a new style will redefine all Stepper instances within that environment.
ja: 各プラットホームは、プラットホームスタイルを反映するある省略時のスタイルを提供します、しかし新しいスタイルを提供することは、全てのStepperインスタンスをその環境内で再定義するでしょう。

source: Each platform provides a default style that reflects the platform style, but providing a new style will redefine all Toggle instances within that environment.
ja: 各プラットホームは、プラットホームスタイルを反映するある省略時のスタイルを提供します、しかし新しいスタイルを提供することは、全てのToggleインスタンスをその環境内で再定義するでしょう。

source: Each platform provides a default style that reflects the platform style, but you can provide a new style that redefines all text field instances within a particular environment.
ja: 各プラットホームは、プラットホームスタイルを反映する省略時のスタイルを提供します、しかしあなたは、特定の環境内で全てのテキストフィールドインスタンスを再定義する新しいスタイルを提供できます。

source: Each square shows the effect of a 36˚ hueRotation (a total of 180˚ across the 5 squares) on the gradient:
ja: 各正方形は、36˚ hueRotationの効果を（５つの正方形にわたって合計180˚）勾配に関して示します。

source: Elements are sorted in ascending order.
ja: 要素は昇順にソートされます。

source: Elements that are used to split the collection are not returned as part of any subsequence.
ja: コレクションを分割するのに使われる要素らは、どれかの下位シーケンスの一部として返されません。

source: Elements that are used to split the sequence are not returned as part of any subsequence.
ja: シーケンスを分割するのに使われる要素らは、どれかの下位シーケンスの一部として返されません。

source: Emitting Node Content
ja: ノード内容を発行する

source: Enable all gestures in the subview hierarchy but disable the added gesture.
ja: 全てのジェスチャをサブビュー階層において有効にします、しかし加えられたジェスチャを無効にします。

source: Enable both the added gesture as well as all other gestures on the view and its subviews.
ja: 加えられたジェスチャをそれだけでなく全ての他のジェスチャを両方ともビューおよびそれのサブビュー上で有効にします。

source: Enable the added gesture but disable all gestures in the subview hierarchy.
ja: 加えられたジェスチャを有効にします、しかし全ての他のジェスチャをサブビュー階層において無効にします。

source: Enhance your views with colors, shapes, and shadows, and customize animated transitions between view states.
ja: あなたのビューを色、輪郭、そして影で強調してください、そしてビューの状態間での転換アニメーションをカスタマイズしてください。

source: Enumeration
ja: 列挙

source: Enumeration Case
ja: 列挙ケース

source: Enumeration Cases
ja: 列挙ケース

source: Enumerations
ja: 列挙

source: Environment Data
ja: 環境データ

source: Environment Values
ja: 環境値

source: Environment data that describes the current state of the system.
ja: 環境データ、それはシステムの現在の状態を記述するものです。

source: Environment values that describe the current state of the system.
ja: システムの現在の状態を記述する環境値。

source: Equality is the inverse of inequality.
ja: 同等性は、不等性の裏返しです。

source: Errors and Exceptions
ja: エラーと例外

source: Essentials
ja: 要点

source: Event-Based Processing
ja: イベント基盤の処理

source: Example Usage
ja: 使用例

source: Executes a closure with the specified transaction and returns the result.
ja: あるクロージャをこの指定されたトランザクションで遂行します、そして結果を返します。

source: Executes a closure with this transaction set as the thread’s current transaction and returns the result.
ja: あるクロージャをこのスレッドのもつ現在のトランザクションとして設定されるこの推移で遂行して、結果を返します。

source: Executing Queries
ja: クエリを遂行する

source: Executing Transactional Closures
ja: トランザクションの性質のクロージャを遂行する

source: Expands the view out of its safe area.
ja: ビューをそれの安全領域の外に拡張します。

source: Extends the view out of the safe area on the specified edges.
ja: ビューをこの指定された縁上の安全領域の外に拡張します。

source: Finally, when you combine gestures exclusively, SwiftUI recognizes the entire gesture pattern when SwiftUI only recognizes one subgesture but not the others.
ja: 最後に、あなたがジェスチャを排他的に結合する場合、SwiftUIが１つの下位ジェスチャを認識するだけで他のものをしない時にSwiftUIは全体のジェスチャパターンを認識します。

source: Find the built-in styles for different types of views.
ja: 組込みのスタイルを異なる型のビューに対して捜します。

source: Finds items that conform to at least one of the specified uniform type identifiers.
ja: 少なくとも１つの指定のユニホーム型識別子に準拠する項目を探します。

source: Fit the container to the size of the preview when offered the size of the device on which the preview is running.
ja: コンテナをプレビューの大きさに合わせます、それの上でプレビューが動作しているデバイスの大きさを提案した時に。

source: Fitting Text into Available Space
ja: テキストを利用可能な空間へと収める

source: Fixes the center of the view at the specified coordinates in its parent’s coordinate space.
ja: ビューの中心をこの指定された座標でそれの親のもつ座標空間において固定します。

source: Fixes the center of the view at the specified point in its parent’s coordinate space.
ja: ビューの中心をこの指定された点でそれの親のもつ座標空間において固定します。

source: Fixes the view at its ideal size in the specified dimensions.
ja: 指定された次元それらにおいて、ビューをそれの最適な大きさに固定します。

source: Fixes the view at its ideal size.
ja: ビューをそれの最適な大きさに固定します。

source: Fixes this view at its ideal size in the specified dimensions.
ja: このビューをこの指定された次元それらにおいてそれの理想的なサイズに治します。

source: Fixes this view at its ideal size.
ja: このビューをそれの理想的なサイズに治します。

source: Flag that indicates whether the receiver distinguishes case in the characters it scans.
ja: レシーバが、それが走査する文字においてケースを識別するかどうかを指し示すフラグ。

source: Flag that indicates whether the receiver has exhausted all significant characters.
ja: レシーバが全ての有意文字を使い果たしたかどうかを指し示すフラグ。

source: Focused View State
ja: フォーカスされたビュー状態

source: Follow a series of guided tutorials to learn to make apps using SwiftUI and Xcode.
ja: 一連の案内付き指導書に従ってSwiftUIとXcodeを使うアプリ作成を学んでください。

source: For NSKeyValueChange.insertion or NSKeyValueChange.replacement, if new was specified when the observer was registered, the value for this key is an NSArray instance that contains the objects that have been inserted or replaced other objects, respectively.
ja: NSKeyValueChange.insertionまたはNSKeyValueChange.replacementに対して、newがそのオブザーバが登録された時に指定されたならば、このキーに対する値はあるNSArrayインスタンスで、それは挿入または他のオブジェクトと置換されたオブジェクトそれらをそれぞれ含みます。

source: For NSKeyValueChange.removal or NSKeyValueChange.replacement, if old was specified when the observer was registered, the value is an NSArray instance that contains the objects that have been removed or have been replaced by other objects, respectively.
ja: NSKeyValueChange.removalまたはNSKeyValueChange.replacementに対して、oldがそのオブザーバが登録された時に指定されたならば、値はあるNSArrayインスタンスで、それは除去されたまたは他のオブジェクトによって置換されたオブジェクトそれらをそれぞれ含みます。

source: For NSKeyValueChangeInsertion or NSKeyValueChangeReplacement, if NSKeyValueObservingOptionNew was specified when the observer was registered, the value for this key is an NSArray instance that contains the objects that have been inserted or replaced other objects, respectively.
ja: NSKeyValueChangeInsertionまたはNSKeyValueChangeReplacementに対して、NSKeyValueObservingOptionNewがそのオブザーバが登録された時に指定されたならば、このキーに対する値はあるNSArrayインスタンスで、それは挿入または他のオブジェクトと置換されたオブジェクトそれらをそれぞれ含みます。

source: For NSKeyValueChangeRemoval or NSKeyValueChangeReplacement, if NSKeyValueObservingOptionOld was specified when the observer was registered, the value is an NSArray instance that contains the objects that have been removed or have been replaced by other objects, respectively.
ja: NSKeyValueChangeRemovalまたはNSKeyValueChangeReplacementに対して、NSKeyValueObservingOptionOldがそのオブザーバが登録された時に指定されたならば、値はあるNSArrayインスタンスで、それは除去されたまたは他のオブジェクトによって置換されたオブジェクトそれらをそれぞれ含みます。

source: For additional information about how to use views and controls, see Human Interface Guidelines.
ja: どのようにビューとコントロールを使うかについての追加情報として、ヒューマンインータフェイスガイドラインを見てください。

source: For all subsequent updates, the system calls the updateNSView(_:context:) method.
ja: 全てのその後の更新に対して、システムはupdateNSView(_:context:)メソッドを呼び出します。

source: For all subsequent updates, the system calls the updateNSViewController(_:context:) method.
ja: 全てのその後の更新に対して、システムはupdateNSViewController(_:context:)メソッドを呼び出します。

source: For all subsequent updates, the system calls the updateUIView(_:context:) method.
ja: 全てのその後の更新に対して、システムはupdateUIView(_:context:)メソッドを呼び出します。

source: For all subsequent updates, the system calls the updateUIViewController(_:context:) method.
ja: 全てのその後の更新に対して、システムはupdateUIViewController(_:context:)メソッドを呼び出します。

source: For all subsequent updates, the system calls the updateWKInterfaceObject(_:context:) method.
ja: 全てのその後の更新に対して、システムはupdateWKInterfaceObject(_:context:)メソッドを呼び出します。

source: For an app localized in both English and Spanish, the above view displays “pencil” and “lápiz” for English and Spanish users, respectively.
ja: 英語とスペイン語の両方でローカライズされたアプリに対して、上のビューは “pencil” と “lápiz” を英語とスペイン語のユーザにそれぞれ表示します。

source: For any value, x + .zero == x and .zero + x == x.
ja: 随意の値に対して、x + .zero == xおよび.zero + x == x。

source: For any values a and b, a != b implies that a == b is false.
ja: 何らかのaとbに対して、a != bはa == bがfalseであることを意味します。

source: For any values a and b, a == b implies that a != b is false.
ja: 何らかの値aとbに対して、a == bはa != bがfalseであることを意味します。

source: For collections that don’t conform to RandomAccessCollection, accessing the count property iterates through the elements of the collection.
ja: RandomAccessCollectionに準拠しないコレクションに対して、countプロパティにアクセスすることはコレクションの要素を始めから終わりまで反復します。

source: For convenience, an XMLParser object in the following descriptions is sometimes referred to as a parser object.
ja: 便宜上、以下の記述でのXMLParserオブジェクトは、時にはパーサーオブジェクトとして参照されます。

source: For error codes not listed here, see the <libxml/xmlerror.h> header file.
ja: ここで一覧にされないエラーコードについて、<libxml/xmlerror.h>ヘッダファイルを見てください。

source: For example, a value transformer could take an NSImage or UIImage object and return an NSData object containing the PNG representation of that image.
ja: たとえば、ある値変換器は、NSImageまたはUIImageオブジェクトを取り、そしてその画像のPNG表現を含んでいるNSDataオブジェクトを返せます。

source: For example, SwiftUI invokes the updating callback as soon as a magnification gesture begins and then again whenever the magnification value changes.
ja: 例えば、SwiftUIは、拡大ジェスチャが開始するとすぐにそしてさらにまた拡大値が変化する時はいつでも更新コールバックを発動します。

source: For example, a VStack instance on its own acts only to vertically stack other views, and has no text to display.
ja: 例えば、VStackインスタンスは独立して、垂直に他のビューを積みかさるためだけの役割をします、そして表示するテキストを持ちません。

source: For example, a DTD entity-declaration node could represent an unparsed entity declaration (XMLDTDNode.DTDKind.unparsed) rather than a parameter entity declaration (XMLDTDNode.DTDKind.parameter).
ja: 例えば、あるDTDエンティティ宣言ノードは、構文解析されないエンティティ宣言（XMLDTDNode.DTDKind.unparsed）を表すかもしれません、パラメータエンティティ宣言（XMLDTDNode.DTDKind.parameter）よりむしろ。

source: For example, a button that toggles between play and pause can create a binding to a property of its parent view using the @Binding property wrapper.
ja: 例えば、再生と一時停止の間で切り替えるあるボタンは、バインディングをそれの親ビューのプロパティーに対して@Bindingプロパティラッパーを使って作成できます：

source: For example, a button’s label might use the accent color for its text.
ja: 例えば、あるボタンのもつラベルは、アクセントカラーをそれのテキストに対して使うかもしれません。

source: For example, a label with a minimumScaleFactor of 0.5 draws its text in a font size as small as half of the actual font, if needed.
ja: 例えば、minimumScaleFactorに0.5をもつラベルは、それのテキストを実際のフォントの半分くらい小さいフォントサイズで描画します、もし必要ならば。

source: For example, a label with a minimumScaleFactor of 0.5 draws its text in a font size as small as half the actual font if needed.
ja: 例えば、minimumScaleFactorの0.5をもつラベルは、それのテキストを実際のフォントの半分ほどの小さなフォントサイズで描画します、もし必要ならば。

source: For example, a label with a minimumScaleFactor of 0.5 draws its text in a font size as small as half of the actual font if needed.
ja: 例えば、minimumScaleFactorに0.5をもつラベルは、それのテキストを実際のフォントの半分くらい小さいフォントサイズで描画します、もし必要ならば。

source: For example, adding the opacity(_:) modifier to a text view returns a new view with some amount of transparency:
ja: 例えば、opacity(_:)修飾子をテキストビューに加えることは、ある量の透明度での新しいビューを返します：

source: For example, an HStack with multiple pieces of text longer than three lines caps each piece of text to three lines rather than capping the total number of lines across the HStack.
ja: 例えば、３行より長いテキストの断片を複数もつHStackは、テキストの各断片を３行に制限します、HStack全体にわたる行の総数を制限するのではなく。

source: For example, blue converts to yellow, and white converts to black.
ja: 例えぱ、青は黄に変わります、そして白は黒に変わります。

source: For example, combining a fixed width and a line limit of 1 results in truncation for text that doesn’t fit in that space:
ja: 例えば、ある固定幅と行制限1の組み合わせは、テキストの切り詰めという結果になります。

source: For example, don’t use the label “Play button” because a button already has a trait that identifies it as a button.
ja: 例えば、ラベル “Play button” を使わないでください、なぜならボタンは既にそれをボタンと識別する特徴を持つからです。

source: For example, during a LongPressGesture if the user stops touching the view before minimumDuration seconds have elapsed or moves their finger more than maximumDistance points SwiftUI does not invoke the onEnded(_:) callback.
ja: 例えば、LongPressGestureの間にもしユーザがビューをタッチすることをminimumDuration秒が過ぎてしまう前に止めるまたは彼らの指がmaximumDistanceポイントより多く動くならば、SwiftUIはonEnded(_:)コールバックを発動しません。

source: For example, for a slider that you label as “Volume” using accessibility(label:), you can provide the current volume setting, like “60%”, using accessibility(value:).
ja: 例えば、あなたが accessibility(label:) を使って “Volume” とラベルをつけるスライダーに対して、あなたは現在のボリューム設定を、“60%” のように、accessibility(value:) を使って提供できます。

source: For example, if the same app lacks Danish localization, the view displays “pencil” for users in that locale.
ja: 例えば、同じアプリがデンマーク語ローカライゼーションを欠いているならば、ビューは “pencil” をユーザにそのロケールにおいて表示します。

source: For example, if you had oneSecondAnimation.speed(0.25), it would be at 25% of its normal speed, so you would have an animation that would last 4 seconds.
ja: 例えば、あなたがoneSecondAnimation.speed(0.25)を持つならば、それはそれの通常の速度の25%であるでしょう、それであなたは４秒間続くアニメーションを持つでしょう。

source: For example, if you horizontally fix a text view before wrapping it in the frame view, you’re telling the text view to maintain its ideal width.
ja: 例えば、あなたがあるテキストビューをそれをフレームビューの中に包む前に水平的に治すならば、あなたはテキストビューにそれの理想的な幅を保守するよう伝えています。

source: For example, if you’re drawing a figure eight or infinity symbol (∞) starting from its center, setting the startFraction and endFraction to different values determines the parts of the overall shape.
ja: 例えば、あなたが８または無限記号（∞）をそれの中心から開始して描画しているならば、startFractionとendFractionを異なる値に設定することは、形状全体のうちの部分に影響します。

source: For example, in a standard view, the default picker styles by platform are:
ja: 例えば、標準的なビューにおいて、省略時のピッカースタイルはプラットホームによって：

source: For example, in the following code example PlayerView projects a binding of the state property isPlaying to the PlayButton view using $isPlaying.
ja: 例えば、以下のコード例においてPlayerViewは状態プロパティisPlayingのあるバインディングをPlayButtonビューに対して$isPlayingを使って投影をします。
